In [2]:
import sqlite3
import os
import pandas as pd

In [6]:
conn = sqlite3.connect('database.db')
cursor = conn.cursor()

# Get the list of CSV files in the "Relations" folder
folder_path = 'Relations'
csv_files = [file for file in os.listdir(folder_path) if file.endswith('.csv')]

# Iterate over the CSV files and create dataframes
for file in csv_files:
    file_path = os.path.join(folder_path, file)
    table_name = os.path.splitext(file)[0]  # Use the file name as the table name
    
    # Read the CSV file into a dataframe
    df = pd.read_csv(file_path)
    
    # Add the dataframe to the SQLite3 database
    df.to_sql(table_name, conn, if_exists='replace')

# Commit the changes and close the connection
conn.commit()

Q1. Are there any employees that are 'female' and that work in project 'computerization' with an effort of '10' hours per week, and that have 'jennifer' as a supervisor? if so, list them.

In [33]:
pd.read_sql_query("SELECT employee_name FROM employee e JOIN female f ON e.employee_name = f.name JOIN workson w ON e.employee_name = w.name JOIN supervise s ON e.employee_name = s.subordinate WHERE w.project = 'computerization' AND w.effort = 10 AND s.supervisor = 'jennifer'", conn)

  EMPLOYEE_NAME
0        alicia

Q2. Who is the employee who makes over "40000" dollars a year and works for the "research" department?

In [39]:
pd.read_sql_query("SELECT s.employee_name FROM salary s JOIN department d ON s.employee_name == d.employee_name WHERE s.salary > 40000 AND d.department = 'research'", conn)

  EMPLOYEE_NAME
0      franklin

Q3. Who is the supreme chief of this fictional company (aka the President)

In [44]:
pd.read_sql_query("SELECT employee_name FROM employee WHERE employee_name IN (SELECT supervisor FROM supervise) AND employee_name NOT IN (SELECT subordinate FROM supervise)", conn)

  EMPLOYEE_NAME
0         james

Q4. Who are the individuals that work on project 'productx' with an 'effort' of 20 or more hours a week?

In [45]:
pd.read_sql_query("SELECT name FROM workson WHERE project = 'productx' AND effort >= 20", conn)

    NAME
0   john
1  joyce